//Lesson 4
//Task 1 💻
//Пользователь передает через переменную свою фамилию и имя. Выведите приветсвие Привет <Имя> <Фамилия> 5 раз используя для каждого варианта разный регистр
// let fullName: string = 'Привет Dmitry Shkutnik'
// console.log(fullName.repeat(5));
//Task 2 💻
//Дана строка 'я учу typescript!'. Проверить, есть ли данное слово в строке: если есть - вывести позицию подстроки 'учу', если нет - вывести строку Данной подстроки нет
//Task 5 💻
//Дана строка 'я учу typescript!'. Вырежите из нее слово 'учу' и слово 'typescript' разными способами (через substring, slice).
var testString = 'я учу typescript!';
console.log(testString.substring(0, 1));
console.log(testString.slice(0, -15));
