//Type script tasks:

//Task 1. Создайте переменные, затем сложите их и выведите результат в консоль разработчика.

let x: number = 20;
let y: number = 58;
let z: number = 42;

console.log(x + y + z);

// //Task 2
// Создайте переменные:
// - количество секунд в минуте
// - количество минут в часу
// - количество часов в сутках
// - количество суток в году
// Посчитайте ваш возраст в секундах и поместите результат в переменную myAgeInSeconds

let secInMin: number = 60;
let minInHour: number = 60;
let hoursInDay: number = 24;
let daysInYear: number = 365;

function ageInSec() {
  return 25 * daysInYear * hoursInDay * minInHour * secInMin;
}

let myAgeInSeconds = ageInSec();
console.log(myAgeInSeconds);

//Task 3
// Создайте две переменные. Поместите в них переменную count и превратите в строку,
// а userName наоборот в число. Попробуйте реализовать задачу двумя разными способами.

//1 вариант
let count: number = 42;
let countString: string = String(count);

let userName: string = "42";
let userNameNumber: number = Number(userName);

console.log(typeof countString);
console.log(typeof userNameNumber);

//2 вариант
let count2: number = 42;
let countString2: string = count2.toString();

let userName2: string = "42";
let userNameNumber2: number = parseInt(userName2);

console.log(typeof countString2);
console.log(typeof userNameNumber2);

// Task 4
// Имеется три переменны. Сложите переменные так, чтобы в результате получилось
// выражение: 12 белых медведей и результат выведите в консоль.

let a2: number = 1;
let aStr: string = String(a2);

let b2: number = 2;
let bStr: string = String(b2);

let c: string = " белых медведей";

console.log(aStr + bStr + c);

//Task 5
// Создайте переменные и поместите в них нижеприведенные слова. Затем создайте еще одну переменную lengthWords
// и посчитайте в ней длинну всех слов из списка (у строк есть свойство length):
// - доступ
// - морпех
// - наледь
// - попрек
// - рубило

let numA: string = "доступ";
let numB: string = "морпех";
let numC: string = "наледь";
let numD: string = "попрек";
let numF: string = "рубило";

let lengthWords: string = numA + numB + numC + numD + numF;

console.log(lengthWords.length);

// Task 6
// Создать 3 переменные разных типов и вывести в консоль для каждой из них строку следующего вида:
// `Variable: %variable name% have type: %type variable%`

let variableNum: number = 25;
let variableStr: string = "Dmitry";
let variableBool: boolean = true;

console.log(`Varivable ${variableNum} have type: ${typeof variableNum}`);
console.log(`Varivable ${variableStr} have type: ${typeof variableStr}`);
console.log(`Varivable ${variableBool} have type: ${typeof variableBool}`);

// Task 7
// Создайте переменные и присвойте им значения:
// Затем с помощью оператора typeof выведите в консоль все типы созданных значений переменных.

let num1: string = "true";
let num2: boolean = false;
let num3: number = 17;
let num4: undefined = undefined;
let num5: null = null;

console.log(typeof num1, typeof num2, typeof num3, typeof num4, typeof num5);

// Task 8
// Даны две переменные.
// С помощью условий выведите в консоль разработчика наибольшее число.

let height = 15;
let width = 20;

console.log(Math.max(height, width)); // вариант с помощью метода math.max - возвращает наибольшее из чисел

//Второй способ с создание переменной max внутри условия
let height2: number = 15;
let width2: number = 20;

if (height2 > width2) {
  var max = height2;
} else {
  var max = width2;
}

console.log(max);

// Task 9
// Написать перебор от 1 до 20, где выведутся все числа кратные трём.
// Для вычисления кратности обратите внимание на оператор %

// Task 10
// Нам надо идти на работу, но нужно проверить все ли мы взяли или нет? Нам точно нужны ключи документы и ручка, но из еды нам надо яблоко или апельсин. Для решения этой задачи нам помогут логические операторы || &&.

// let key = true;
// let documents = true;
// let pen = true;
// let apple = false;
// let orange = true;

// Task 11
// Написать программу, которая принимает число:
// 1. Если число делится без остатка на 5 выводим сообщение Fiz
// 2. Если число делится без остатка на 3 выводим сообшение Buz
// 3. Если число делится без остатка и на 3 и на 5 выводим сообшение FizBuz

let acceptNumber: number = 15;

if (acceptNumber % 3 == 0 && acceptNumber % 5 == 0) {
  console.log("FizBuz");
} else if (acceptNumber % 3 == 0) {
  console.log("Buz");
} else {
  console.log("Fiz");
}




// //Task 12 💻
// Написать программу, которая выполняет следующие операции:

// Получает возраст пользователя, если он больше 18, то выводит сообщение - Попей пивка.
// Если меньше, то выводит сообщение - Пей колу.
// Добавить условие, что если возраст от 16-18, выводим сообщение - Можешь выкурить сигаретку, только маме не говори.


let userAge : number = 18;

if(userAge >= 16 && userAge <= 18){
  console.log('Можешь выкурить сигаретку, только маме не говори')
} else if (userAge > 18){
  console.log('Попей пивка')
}else {
  console.log('Пей колу')
}





// Task 13 💻
// Напишем программу для туристического терминала. Создат переменную для стороны света в которую 
// пользовател хотел отправиться. После ввода данных мы должны вывести в консоль сообщение из списка. 
// Если пользователь ввел неверные данные, выведите сообщение в консоль чтобы он попробовал еще раз.

// юг на юг пойдешь счастье найдешь
// север на север пойдешь много денег найдешь
// запад на запад пойдешь верного друга найдешь
// восток на восток пойдешь разработчиком станешь
// Используйте конструкцию switch

let compassPoints: string = 'west';

switch (compassPoints) {
  case 'south' :
    console.log ('на юг пойдешь счастье найдешь');
    break;
  case 'north' : 
    console.log ('на север пойдешь много денег найдешь');
    break;
  case 'west' :
    console.log ('на запад пойдешь верного друга найдешь');
    break;
  case 'east' :
    console.log ('на восток пойдешь разработчиком станешь');
    break;
  default:
    console.log ('Попробуйте ещё раз');
  }


// ADVANCED level
// Task 1 👨‍🏫
// Поменяйте значение переменных местами не создавая дополнительной переменной:
  //Вариант1
  let a = 4;
  let b = 3;

  [a,b] = [b,a]

  console.log(a);
  console.log(b);

  //Вариант2
  let a1 = 4;
  let b1 = 3;

      b1 = a1+b1;
      a1 = b1-a1;
      b1 = b1-a1;

console.log(a);
console.log(b);


